In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'total_bill': [16.99, 10.34, 23.68, 23.68, 24.59],
                   'tip': [1.01, 1.66, 3.50, 3.31, 3.61],
                   'sex': ['Female', 'Male', 'Male', 'Male', 'Female']})

In [3]:
df

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       23.68  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [4]:
df[['tip','sex']]

    tip     sex
0  1.01  Female
1  1.66    Male
2  3.50    Male
3  3.31    Male
4  3.61  Female

In [5]:
df[0:3]

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       23.68  3.50    Male

In [6]:
df.loc[2]

total_bill    23.68
tip             3.5
sex            Male
Name: 2, dtype: object

In [7]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
df.columns[:1]

Index(['total_bill'], dtype='object')

In [9]:
df

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       23.68  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [10]:
df.loc[1:3,['tip','sex']]

    tip   sex
1  1.66  Male
2  3.50  Male
3  3.31  Male

In [11]:
df.iloc[1:3, 1:3]

    tip   sex
1  1.66  Male
2  3.50  Male

In [12]:
df.iloc[1:4, [0,2]]

   total_bill   sex
1       10.34  Male
2       23.68  Male
3       23.68  Male

In [13]:
df[1:3]

   total_bill   tip   sex
1       10.34  1.66  Male
2       23.68  3.50  Male

In [14]:
df[['tip','total_bill']]

    tip  total_bill
0  1.01       16.99
1  1.66       10.34
2  3.50       23.68
3  3.31       23.68
4  3.61       24.59

In [15]:
df[ df['sex'] == 'Male']

   total_bill   tip   sex
1       10.34  1.66  Male
2       23.68  3.50  Male
3       23.68  3.31  Male

In [16]:
df[ (df['sex'] == 'Male') & (df['tip'] > 3.31) ]

   total_bill  tip   sex
2       23.68  3.5  Male

In [17]:
df.sex == 'Male'

0    False
1     True
2     True
3     True
4    False
Name: sex, dtype: bool

In [18]:
df

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       23.68  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [19]:
df[ df.total_bill.isin([10.34, 24.59])]  # in

   total_bill   tip     sex
1       10.34  1.66    Male
4       24.59  3.61  Female

In [20]:
df[ -(df.sex=='Female')]  # not

   total_bill   tip   sex
1       10.34  1.66  Male
2       23.68  3.50  Male
3       23.68  3.31  Male

In [21]:
#distinct
df.sex

0    Female
1      Male
2      Male
3      Male
4    Female
Name: sex, dtype: object

In [22]:
df.drop_duplicates(subset=['sex'], keep='first', inplace=False)

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male

In [23]:
df

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       23.68  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [24]:
df.groupby('sex').count()

        total_bill  tip
sex
Female           2    2
Male             3    3

In [25]:
df.groupby('sex').size()

sex
Female    2
Male      3
dtype: int64

In [26]:
df.groupby('sex')['tip'].sum()

sex
Female    4.62
Male      8.47
Name: tip, dtype: float64